#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>


////本节主要学习数据的二进制存储
//int main()
//{
//	char a = 10;//原本10的二进制：00000000000000000000000000001010,转换为char类型后：00001010
//	printf("%d\n", a);//整型提升：00000000000000000000000000001010，a为有符号类型且符号位为0，所以用0补充
//
//	return 0;
//
//}

//int main()
//{
//	char a = -10;//-10的二进制原码：10000000000000000000000000001010  反码：11111111111111111111111111110101 补码：11111111111111111111111111110110
//				//转换为char类型补码: 11110110
//	printf("%d\n", a);//整型提升补码：11111111111111111111111111110110 反码：10000000000000000000000000001001 补码：10000000000000000000000000001010
//	return 0;
//}

// %u： 代表无符号整型

//int main()
//{
//	char a[1000];
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));//255    -1,-2.....-128,127,......3,2,1,0 ,-1,..... strlen会计算'\0'（数字0）之前的字符个数
//	return 0;
//}


